import time
import sys

songname = "\033[38;2;255;165;0m-- รักคุณเข้าแล้ว --\033[0m"
lyrics = (
    ("เก็บเพลงรักนี้ให้เป็นของขวัญ", 3.3),
    ("ให้เธอได้รับได้รู้หัวใจของฉัน", 2.7),
    ("แม้คืนวันจะเปลี่ยนแปลงสักแค่ไหน", 5.2),
    ("แต่ใจของฉันที่รักเธอนั้น", 3.6),
    ("ต่อให้ต้องลงนรกหรือขึ้นสรวงสวรรค์", 3.3),
    ("ฉันก็จะไม่มีวันมอบให้ใคร", 5.1),
    ("จะมีเพียงเธอแค่เพียงคนเดียว", 3.9),
    ("และจะมีแต่เธอ เธอแค่เพียงคนเดียว", 3.2),
    ("และจะเป็นเพียงคนเดียวเสมอไป", 5.2),
    ("ที่ฉันฝากชีวิต ทั้งหมดไว้", 7.1),
    ("โดยไม่มีทางทวงกลับคืน", 4.2),
)

for line, delay in lyrics:
    dpl = delay / len(line)
    for char in line:
        print(char, end='')
        sys.stdout.flush()
        time.sleep(dpl)
    print('\n')

print(songname + '\n\n< Khian Code Gun />')
