import time

lyrics = (
    ("โชคดีเหลือเกิน ที่เราได้เจอกัน", 3),
    ("โชคดีที่เธอ ยังยอมอยู่ข้างฉัน", 3.5),
    ("ไหนใครว่าเวลาเปลี่ยนไป", 3.5),
    ("หัวใจใครๆมักเปลี่ยนแปลง", 3.5),
    ("โชคดีเหลือเกิน ที่เรายังมีกัน", 3),
    ("ทุกช่วงเวลา เธอยังอยู่ข้างฉัน", 3),
    ("ไหนว่าผู้คนมักเปลี่ยนไป", 3),
    ("โชคดีที่หัวใจ ของเราไม่เคยเปลี่ยนเลย", 3),
    ("\033[38;2;255;165;0m-- ไม่เปลี่ยนเลย (Best Luck) | fellow fellow --\033[0m", 0)

)

for line, delay in lyrics:
    for char in line:
        print(char, end='')
    print() 
    print() 
    time.sleep(delay) 
